In [2]:
print("Pandas")

Pandas

In [3]:
#load pandas library
import pandas as pd

In [5]:
#Pandas DataTypes
#DataFrame
#Series

# series

In [7]:
s=pd.Series([1,2,3,4,5,6,7])
print(s)

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int64

# DataFrame

In [28]:
#key,value
data={
    'Name': ['Rahat','Shihab','Jihad','Kabir'],
    'Age': [23,21,18,20],
    'City' : ['New York','California','Texas','Dhaka']
}

df = pd.DataFrame(data)
df

     Name  Age        City
0   Rahat   23    New York
1  Shihab   21  California
2   Jihad   18       Texas
3   Kabir   20       Dhaka

In [29]:
#data shape
df.shape

(4, 3)

In [13]:
print(df.shape)

(4, 3)

In [14]:
print("Row :",df.shape[0])
print("Col :",df.shape[1])

Row : 4
Col : 3

In [15]:
df.head() #returns first 5 row by default

    Name   Age         City
0   Rahat    23    New York
1  Shihab    21  California
2   Jihad    18       Texas
3   Kabir    20       Dhaka

In [16]:
df.head(2) #specific

    Name   Age         City
0   Rahat    23    New York
1  Shihab    21  California

In [30]:
df.tail() #Returns last 5 rows by default

     Name  Age        City
0   Rahat   23    New York
1  Shihab   21  California
2   Jihad   18       Texas
3   Kabir   20       Dhaka

In [31]:
df.tail(1)

    Name  Age   City
3  Kabir   20  Dhaka

In [32]:
#columns
df.columns

Index(['Name', 'Age', 'City'], dtype='object')

In [33]:
df.Name

0     Rahat
1    Shihab
2     Jihad
3     Kabir
Name: Name, dtype: object

In [34]:
df['Name'] #preffered

0     Rahat
1    Shihab
2     Jihad
3     Kabir
Name: Name, dtype: object

In [37]:
df[['Name','Age']]

     Name  Age
0   Rahat   23
1  Shihab   21
2   Jihad   18
3   Kabir   20

In [38]:
df['Age'].max()

23

In [39]:
df['Age'].min()

18

In [40]:
#condition
df[df['Age']>20]

     Name  Age        City
0   Rahat   23    New York
1  Shihab   21  California

In [42]:
df.loc[0]

Name       Rahat
Age           23
City    New York
Name: 0, dtype: object

# Iris Dataset Load

In [43]:
df=pd.read_csv('iris.CSV')

In [44]:
df

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [45]:
df.shape

(150, 5)

In [46]:
df.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [47]:
df.tail(10)

     sepal_length  sepal_width  petal_length  petal_width    species
140           6.7          3.1           5.6          2.4  virginica
141           6.9          3.1           5.1          2.3  virginica
142           5.8          2.7           5.1          1.9  virginica
143           6.8          3.2           5.9          2.3  virginica
144           6.7          3.3           5.7          2.5  virginica
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

In [48]:
df.head(10)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa
5           5.4          3.9           1.7          0.4  setosa
6           4.6          3.4           1.4          0.3  setosa
7           5.0          3.4           1.5          0.2  setosa
8           4.4          2.9           1.4          0.2  setosa
9           4.9          3.1           1.5          0.1  setosa

In [49]:
df.sepal_length

0      5.1
1      4.9
2      4.7
3      4.6
4      5.0
      ...
145    6.7
146    6.3
147    6.5
148    6.2
149    5.9
Name: sepal_length, Length: 150, dtype: float64

In [50]:
df.sepal_length.max()

7.9

In [51]:
df.sepal_length.min()

4.3

In [52]:
df.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

In [54]:
df.info() #generate a dataset report summary

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [55]:
df.describe() #see the dataset statical summary

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.054000      3.758667     1.198667
std        0.828066     0.433594      1.764420     0.763161
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [56]:
df['petal_width'].unique()

array([0.2, 0.4, 0.3, 0.1, 0.5, 0.6, 1.4, 1.5, 1.3, 1.6, 1. , 1.1, 1.8,
       1.2, 1.7, 2.5, 1.9, 2.1, 2.2, 2. , 2.4, 2.3])

In [58]:
df.species.value_counts()

setosa        50
versicolor    50
virginica     50
Name: species, dtype: int64

In [66]:
df.sepal_length.sum()

876.5

# END